import 'package:flutter/material.dart';
import 'package:myapp/screens/prayer_page.dart';

class EveningPrayerPage extends StatelessWidget {
  const EveningPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'ლოცვა საღამოს 9 საათზე',
      imagePath: 'assets/images/21.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხარ ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

ფსალმუნი 127

1. ნეტარ არიან ყოველნი, რომელთა ეშინის უფლისა, და რომელნი ვლენან გზათა მისთა. 2. ნაშრომი ნაყოფთა შენთაი შჭამო შენ, ნეტარ იყო და კეთილი გეყოს შენ. 3. ცოლი შენი ვითარცა ვენახი მსხმოი კიდეთა სახლისა შენისათa. 4. შვილნი შენნი ვითარცა ახალნერგნი ზეთის-ხილისანი გარემოის ტაბლისა შენისა. 5. აჰა ესერა ესრეთ იკურთხოს კაცი, რომელსა ეშინოდის უფლისა. 6. გაკურთხოს შენ უფალმან სიონით, და იხილო შენ კეთილი იერუსალემისაი ყოველთა დღეთა ცხოურებისა შენისათა. 7. და იხილნე შენ შვილნი შვილთა შენთანი, მშვიდობაი ისრაელსა ზედა.

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო ჩვენო, დიდება შენდა.

ტროპარი წმიდა ნიკოლოზისა

კანონად სარწმუნოებისა და ხატად სიმშვიდისა და მოძღვრად მარხვისა გყო შენ ქრისტემან სამწყსოსა შენისათვის ჭეშმარიტებით, ამისთვისცა მოიგე სიმდაბლითა სიმაღლე და სიგლახაკითა სიმდიდრე, წმიდაო დიდო მღვდელმთავარო ნიკოლოზ, ევედრე ქრისტესა ღმერთსა შეწყალებად სულთა ჩვენთათვის. ამინ!
''',
    );
  }
}
