
import 'package:flutter/material.dart';
import 'package:myapp/screens/prayer_page.dart';

class MidnightPrayerPage extends StatelessWidget {
  const MidnightPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'ღამის 12 საათის ლოცვა',
      imagePath: 'assets/images/00.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხარ ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

ფსალმუნი 133

1. აქა აკურთხევდით უფალსა ყოველნი მონანი უფლისანი, რომელნი სდგათ სახლსა უფლისასა, ეზოთა სახლისა ღმრთისა ჩუენისათა. 2. ღამესა აღიპყრენით ხელნი თქუენნი წმიდად მიმართ და აკურთხევდით უფალსა. 3. გაკურთხოს შენ უფალმან სიონით, რომელმან ჰქმნა ცანი და ქუეყანაი.
დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.

ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო ჩვენო, დიდება შენდა.

წმიდათა თანა განუსვენე, ქრისტე ღმერთო, საუკუნითგან გარდაცვალებულთა მონათა და მხევალთა შენთა, სადა იგი არა არს ჭირი, მწუხარება, არა ურვა, არცა სულთქმა. არამედ სიხარული და ცხოვრება იგი დაუსრულებელი.

აჰა ესერა სიძე მოვალს შუაღამესა, და ნეტარ არს მონაჲ იგი, რომელი იპოვოს მღვიძარედ, ხოლო ვაი არს მონისა მის, რომელი იპოვოს უდებებით. იხილე სულო ჩემო, და ნუ გრულის ძილისათვის, რათა არა გამოვარდე სასუფეველისაგან, არამედ აღიმსთვე შუაღამესა, და ხმობდე: წმიდა ხარ, წმიდა ხარ, წმიდა ხარ შენ ღმერთო ჩუენო, ღვთისმშობელისა მიერ შეგვიწყალენ ჩუენ.
ამინ!
''',
    );
  }
}
