import 'package:flutter/material.dart';
import 'package:myapp/widgets/prayer_view.dart';

class MorningPrayerPage extends StatelessWidget {
  const MorningPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'დილის 6 საათის ლოცვა',
      imagePath: 'assets/images/06.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხარ ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

ფსალმუნი 50

მიწყალე მე, ღმერთო, დიდითა წყალობითა შენითა და მრავლითა მოწყალებითა შენითა აღხოცე უსჯულოებაი ჩემი. უფროის განმბანე მე უსჯულოებისა ჩემისაგან და ცოდვათა ჩემთაგან განმწმიდე მე. რამეთუ უსჯულოებაი ჩემი მე უწყი, და ცოდვაი ჩემი წინაშე ჩემსა არს მარადის. შენ მხოლოსა შეგცოდე და ბოროტი შენ წინაშე ვყავ, რაითა განმართლდე სიტყვათა შენთაგან და სძლო სჯასა შენსა. რამეთუ ესერა, უსჯულოებათა შინა მიუდგა და ცოდვათა შინა მშვა მე დედამან ჩემმან. რამეთუ ესერა, ჭეშმარიტებაი შეიყუარე, უჩინონი და დაფარულნი სიბრძნისა შენისანი გამომიცხადენ მე. მასხურო მე უსუპითა და განვწმიდნე მე, განმბანო მე და უფროის თოვლისა განვსპეტაკნე. მასმინო მე გალობაი და სიხარული, და იხარებდენ ძუალნი დამდაბლებულნი. გარე-მიაქციე პირი შენი ცოდვათა ჩემთაგან და ყოველნი უსჯულოებანი ჩემნი აღხოცენ. გული წმიდაი დაჰბადე ჩემ თანა, ღმერთო, და სული წრფელი განმიახლე გუამსა ჩემსა. ნუ განმაგდებ მე პირისა შენისაგან და სულსა წმიდასა შენსა ნუ მიმიღებ ჩემგან. მომეც მე სიხარული მაცხოვარებისა შენისაი და სულითა მთავრობისაითა დამამტკიცე მე. ვასწავლნე უსჯულოთა გზანი შენნი, და უღმრთონი შენდა მოიქცენ. მიხსენ მე სისხლთაგან, ღმერთო, ღმერთო ცხორებისა ჩემისაო; იხარებდეს ენაი ჩემი სიმართლესა შენსა. უფალო, ბაგენი ჩემნი აღახუენ, და პირი ჩემი უთხრობდეს ქებულებასა შენსა. რამეთუ უკეთუმცა გენება, მსხუერპლი შე-მცა-მეწირა, არამედ საკუერთხი არა გთნდეს. მსხუერპლ ღმრთისა არს სული შემუსრვილი, გული შემუსრვილი და დამდაბლებული ღმერთმან არა შეურაცხ-ჰყოს. კეთილი უყავ, უფალო, ნებითა შენითა სიონსა და აღეშენნენ ზღუდენი იერუსალიმისანი. მაშინ გთნდეს მსხუერპლი სიმართლისაი, შესაწირავი და ყოვლად-დასაწუელი, მაშინ შესწირნენ საკურთხეველსა შენსა ზედა ზუარაკნი.

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.

ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, аლილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო ჩვენო, დიდება შენდა.

წმიდაო ღმერთო, წმიდაო ძლიერო, წმიდაო უკვდავო, შეგვიწყალენ ჩვენ (3-გზის).

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.

ყოვლადწმიდაო სამებაო, შეგვიწყალენ ჩვენ; უფალო, გვიხსენ და გვილხინე ცოდვათა ჩვენთაგან; მეუფეო, შეგვინდევ უსჯულოებანი ჩვენნი; წმიდაო, მოიხილე და განჰკურნენ უძლურებანი ჩვენნი სახელისა შენისათვის.
უფალო, შეგვიწყალენ (3-გზის).

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.
''',
    );
  }
}
