import 'package:flutter/material.dart';
import 'package:myapp/widgets/prayer_view.dart';

class NineOClockPrayerPage extends StatelessWidget {
  const NineOClockPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'ლოცვები დილის 9 საათზე',
      imagePath: 'assets/images/09.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხარ ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

ფსალმუნი 50

1. მიწყალე მე, ღმერთო, დიდითა წყალობითა შენითა და მრავლითა მოწყალებითა შენითა აჰხოცე უჰსჯულოებაი ჩემი. 2. უფროის განმბანე მე უჰსჯულოებისა ჩემისაგან და ცოდვათა ჩემთაგან განმწმიდე მე. 3. რამეთუ უჰსჯულოებაი ჩემი მე უწყი, და ცოდვაი ჩემი წინაშე ჩემსა არს მარადის. 4. შენ მხოლოსა შეგცოდე და ბოროტი შენ წინაშე ვჰყავ; რაითა განჰმართლდე სიტყუათაგან შენთა და სძლო შჯასა შენსა. 5. რამეთუ ესერა უჰსჯულოებათა შინა მიუდგა და ცოდვათა შინა მშვა მე დედამან ჩემმან. 6. რამეთუ ესერა ჭეშმარიტებაი შეიყუარე, უჩინონი და დაფარულნი სიბრძნისა შენისანი გამომიცხადენ მე. 7. მასხურო მე უსუპითა და განვსწმიდნე მე, განმბანო მე და უფროის თოვლისა განვსპეტაკნე. 8. მასმინო მე გალობაი და სიხარული, და იხარებდენ ძუალნი დამდაბლებულნი. 9. გარე-მიაქციე პირი შენი ცოდვათა ჩემთაგან და ყოველნი უჰსჯულოებანი ჩემნი აჰხოცენ. 10. გული წმიდაი დაჰბადე ჩემ თანა, ღმერთო, და სული წრფელი განმიახლე გუამსა ჩემსა. 11. ნუ განმაგდებ მე პირისა შენისაგან და სულსა წმიდასა შენსა ნუ მიმიღებ ჩემგან. 12. მომეც მე სიხარული მაცხოვარებისა შენისაი და სულითა მთავრობისათა დამამტკიცე მე. 13. ვასწავლნე უჰსჯულოთა გზანი შენნი და უღმრთონი შენდა მოიქცენ. 14. მიხსენ მე სისხლთაგან, ღმერთო, ღმერთო ცხოურებისა ჩემისაო, იხარებდეს ენაი ჩემი სიმართლესა შენსა. 15. უფალო, ბაგენი ჩემნი აღახუენ, და პირი ჩემი უთხრობდეს ქებულებასა შენსა. 16. რამეთუ უკეთუმცა გენება, მსხუერპლი შე-მცა-მეწირა, არამედ საკუერთხი არა გთნდეს. 17. მსხუერპლი ღმრთისა არს სული შემუსრვილი, გული შემუსრვილი და დამდაბლებული ღმერთმან არა შეურაცხ-ჰყოს. 18. კეთილი უყავ, უფალო, ნებითა შენითა სიონსა და აღეშენნენ ზღუდენი იერუსალემისანი. 19. მაშინ გთნდეს მსხუერპლი სიმართლისაი, შესაწირავი და ყოვლად-დასაწუელი; მაშინ შესწირნენ საკურთხეველსა შენსა ზედა ზუარაკნი.

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო ჩვენო, დიდება შენდა.

ღვთისმშობელი ქალწულო, გიხაროდენ, მიმადლებულო მარიამ, უფალი შენთანა, კურთხეულ ხარ შენ დედათა შორის და კურთხეულ არს ნაყოფი მუცლისა შენისა, რამეთუ მაცხოვარი გვიშევ სულთა ჩვენთა.
ამინ!
''',
    );
  }
}
