import 'package:flutter/material.dart';
import 'package:myapp/widgets/prayer_view.dart';

class SixOClockPrayerPage extends StatelessWidget {
  const SixOClockPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'ლოცვა საღამოს 6 საათზე',
      imagePath: 'assets/images/18.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხარ ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

ფსალმუნი 69

1. ღმერთო, შეწევნასა ჩემსა მოხედენ; უფალო, შეწევნად ჩემდა ისწრაფე. 2. ჰრცხუენოდენ და კდემებოდენ, რომელნი ეძიებენ სულსა ჩემსა მართლ-უკუნ იქცენ და სირცხვილეულ იქმნენ, რომელნი ზრახვიდეს ჩემთვის ძვირსა. 3. მიიქცენ მუნთქუესვე სირცხვილეულნი, რომელნი მეტყოდეს მე: ვაშა, ვაშა! 4. გალობდენ და იხარებდენ შენდამი ყოველნი, რომელნი გეძიებენ შენ, უფალო; და თქუედ მარადის: დიდ არს ღმერთი! რომელთა უყუარს მაცხოვარებაი შენი. 5. ხოლო მე გლახაკ და დავრდომილ ვარი მე; ღმერთო, შემეწიე მე; შემწე და მხსნელი ჩემი ხარი შენ; უფალო, ნუ ჰყოვნი.

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო ჩვენო, დიდება შენდა.

წმიდა გიორგის ტროპარი

ტყვეთა განმათავისუფლებელო და გლახაკთა ხელის აღმპყრობელო, სნეულთა მკურნალო და მეფეთა უძლეველო წინამბრძოლო, ღვაწლით შემოსილო, დიდო მოწამეო გიორგი, ევედრე ქრისტესა ღმერთსა შეწყალებად სულთა ჩვენთათვის.
ამინ!
''',
    );
  }
}
