import 'package:flutter/material.dart';
import 'package:myapp/widgets/prayer_view.dart';

class TwelveOClockPrayerPage extends StatelessWidget {
  const TwelveOClockPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'ლოცვები დღის 12 საათზე',
      imagePath: 'assets/images/12.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხar ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

ფსალმუნი 90

1. რომელი დამკვიდრებულ არს შეწევნითა მაღლისაითა, საფარველსა ღმრთისა ზეცათაისა განისუენოს. 2. ჰრქუას უფალსა: ხელის აღმპყრობელი ჩემი ხარი შენ და შესავედრებელი ჩემი, ღმერთი ჩემი, და მე ვესავ მას. 3. რამეთუ მან გიხსნეს შენ საფრხისა მისგან მონადირეთაისა და სიტყვისა მისგან განსაკრთომელისა. 4. ბეჭთ-საშუალითა მისითა გფარვიდეს შენ, და საგრილსა ფრთეთა მისთასა ესვიდე საჭურველად გარე-მოგადგეს შენ ჭეშმარიტებაი მისი. 5. არა გეშინოდის შიშისაგან ღამისა და ისრისაგან, რომელი ფრინავნ დღისი; 6. ღუაწლისაგან, რომელი ვალნ ბნელსა შინა, შემთხუევისაგან და ეშმაკისა შუა დღისა. 7. დაეცნენ მარცხენით შენსა ათასეულნი და ბევრეულნი – მარჯუენით შენსა, ხოლო შენ არა მიგეახლნენ. 8. ხოლო შენ თუალითა შენითა ჰხედვიდე და მისაგებელი ცოდვილთაი იხილო. 9. რამეთუ შენ, უფალი, ხარ სასო ჩემდა და მაღალი გიყოფიეს შესავედრებელად შენდა. 10. არა შევიდეს შენდა ძვირი, და გუემაი არა მიეახლოს საყოფელთა შენთა. 11. რამეთუ ანგელოზთა მისთადა უბრძანებიეს შენთვის დაცუად შენდა ყოველთა შინა გზათა შენთა; 12. ხელთა მათთა ზედა აღგიპყრან შენ, ნუსადა წარსცე ქვასა ფერხი შენი; 13. ასპიტსა და ვასილისკოსა ზედა ხვიდოდი და დასთრგუნო შენ ლომი და ვეშაპი. 14. რამეთუ მე მესვიდა, და ვიხსნა იგი და დავიფარო იგი, რამეთუ იცნა სახელი ჩემი. 15. ხმა-ჰყოს ჩემდამო, და მე ვისმინო მისი და მის თანა ვიყო ჭირსა შინა; ვიხსნა იგი და ვადიდო იგი. 16. დღეგრძელობითა განვაძღო იგი და უჩუენო მას მაცხოვარებაი ჩემი.

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო ჩვენო, დიდება შენდა.

მოწყალებისა კარი განგვიღე, კურთხეულო ღმრთისმშობელო, რათა, რომელნი ესე შენ გესავთ, არა დავეცნეთ, არამედ განვერნეთ წინააღმდგომთა მტერთაგან, რამეთუ შენ ხარ ცხოვრება ნათესავისა ქრისტიანეთასა.
ამინ!
''',
    );
  }
}
