import 'package:flutter/material.dart';
import 'package:myapp/widgets/prayer_view.dart';

class TwentyThreeOClockPrayerPage extends StatelessWidget {
  const TwentyThreeOClockPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'ლოცვა ძილის წინ',
      imagePath: 'assets/images/23.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხარ ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

განათლდი, განათლდი, ახალო იერუსალიმო, რამეთუ მოიწია შენი ნათელი და დიდება უფლისა შენზედა გამოჩნდა. 

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.

ღირს არს ჭეშმარიტად, რაითა გადიდებდეთ შენ, ღვთისმშობელო, რომელი მარადის სანატრელ იქმენ, ყოვლად უბიწოდ და დედად ღვთისა ჩვენისა. უპატიოსნესსა ქერუბიმთასა და აღმატებით უზესთაესსა სერაფიმთასა, განუხრწნელად მშობელსა სიტყვისა ღვთისასა, მხოლოსა ღვთისმშობელსა გადიდებდეთ.

ამინ!
''',
    );
  }
}
