import 'package:flutter/material.dart';
import 'package:myapp/widgets/prayer_view.dart';

class TwentyOneOClockPrayerPage extends StatelessWidget {
  const TwentyOneOClockPrayerPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const PrayerPage(
      title: 'ლოცვა საღამოს 9 საათზე',
      imagePath: 'assets/images/21.jpg',
      prayerText: '''
მამაო ჩვენო, რომელი ხარ ცათა შინა, წმიდა იყავნ სახელი შენი, მოვედინ სუფევა შენი, იყავნ ნება შენი, ვითარცა ცათა შინა, ეგრეცა ქვეყანასა ზედა, პური ჩვენი არსობისა მომეც ჩვენ დღეს, და მომიტევენ ჩვენ თანანადებნი ჩვენნი, ვითარცა ჩვენ მივუტევებთ თანამდებთა მათ ჩვენთა და ნუ შემიყვანებ ჩვენ განსაცდელსა, არამედ მიხსენ ჩვენ ბოროტისაგან, ამინ.

ფსალმუნი 90

რომელი დამკვიდრებულ არს შეწევნითა მაღლისაითა, საფარველსა ღმრთისა ცათასა განისუენოს. ჰრქუას უფალსა: მფარველი ჩემი ხარი შენ და შესავედრებელი ჩემი, ღმერთი ჩემი, და მე ვესავ მას. რამეთუ მან გიხსნას შენ საფრხისაგან მონადირეთასა და სიტყვისაგან განსაკრთომელისა. ბეჭთა მისთა გფარვიდეს შენ, და ქუეშე ფრთეთა მისთა დაიმალო; საჭურველად გარე-მოგადგეს შენ ჭეშმარიტებაი მისი. არა გეშინოდის შიშისაგან ღამისა და ისრისაგან, რომელი ფრინავნ დღისი. ღუაწლისაგან, რომელი ვალნ ბნელსა შინა, და შემთხუევისაგან და ეშმაკისა შუა-დღისა. დაეცნენ მარცხენით შენსა ათასეულნი და ბევრეულნი მარჯუნით შენსა, ხოლო შენ არა მიგეახლნენ. ხოლო შენ თუალითა შენითა იხილო და მისაგებელი ცოდვილთაი იხილო. რამეთუ შენ, უფალო, ხარ სასო ჩემდა, და მაღალი გიყოფიეს შესავედრებელად შენდა. არა მოვიდეს შენდა ძვირი, და გუემაი არა მიეახლოს საყოფელსა შენსა. რამეთუ ანგელოზთა მისთადა უბრძანებიეს შენთვის დაცვად შენდა ყოველთა შინა გზათა შენთა. ხელთა მათთა ზედა აღგიპყრან შენ, ნუსადა წარსცე ქვასა ფერხი შენი. ასპიტსა და ვასილისკოსა ზედა ხვიდოდი შენ და დასთრგუნო შენ ლომი და ვეშაპი. რამეთუ მე მესვიდა, და ვიხსნა იგი; დავიფარო იგი, რამეთუ იცნა სახელი ჩემი. ხმა-ჰყოს ჩემდამო, და მე ვისმინო მისი და მის თანა ვიყო ჭირსა შინა; ვიხსნა იგი და ვადიდო იგი. დღეთა გრძელითა განვაძღო იგი და უჩუენო მას მაცხოვარებაი ჩემი.

დიდება მამასა და ძესა და წმიდასა სულსა, აწ და მარადის და უკუნითი უკუნისამდე, ამინ.

ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო;
ალილუია, ალილუია, ალილუია დიდება შენდა ღმერთო ჩვენო, დიდება შენდა.

წმიდა გიორგის ტროპარი

ტყვეთა განმათავისუფლებელო და გლახაკთა ხელის აღმპყრობელო, სნეულთა მკურნალო და მეფეთა უძლეველო წინამბრძოლო, ღვაწლით შემოსილო, დიდო მოწამეო გიორგი, ევედრე ქრისტესა ღმერთსა შეწყალებად სულთა ჩვენთათვის.
ამინ!
''',
    );
  }
}
